# parameters
nc: 2  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]   # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
    ######### TransformerBlock One #############
    # stream one
    [-1, 1, Focus, [64, 3]],    # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],   # 2-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 9, C3, [256]],   # 4-P3/8
    # stream two
    [-4, 1, Focus, [64, 3]],    # 5-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 6-P2/4
    [-1, 3, C3, [128]],   # 7-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 8-P3/8
    [-1, 9, C3, [256]],   # 9-P3/8

   ######### TransformerBlock Three #############
   # stream one
    [4, 1, Conv, [512, 3, 2]],   # 10-P4/16
    [-1, 9, C3, [512]],   # 11-P4/16
   # stream two
    [9, 1, Conv, [512, 3, 2]],   # 12-P4/16
    [-1, 9, C3, [512]],   # 13-P4/16
   # transformer fusion
    [[11,13], 1, GPT, [512]],   # 14-P3/8
    [[11,14], 1, Add2, [512,0]],    # 15-P4/16 stream one x+trans[0]
    [[13,14], 1, Add2, [512,1]],    # 16-P4/16 stream two x+trans[1]
   # here fuse to single stream
    [[15,16], 1, Add, [1]],   # 17-P4/16 fusion backbone P4

    ######### Rest Feed-forward #############
    [-1, 1, Conv, [1024, 3, 2]],    # 18-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]],   # 19-P5/32
    [-1, 3, C3, [1024, False]],   # 20-P5/32

    ######### Add Block #############
    [[4,9], 1, Add, [1]],   # 21-P3/8 fusion backbone P3

  ]


# YOLOv5 head
head:
  [
    [20, 1, Conv, [512, 1, 1]],   # 22 conv P5
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 23
    [[-1,17], 1, Concat, [1]],    # 24 cat backbone P4
    [-1, 3, C3, [512, False]],    # 25

    [-1, 1, Conv, [256, 1, 1]],   # 26
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 27
    [[-1,21], 1, Concat, [1]],    # 28 cat backbone P3
    [-1, 3, C3, [256, False]],    # 29 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],   # 30
    [[-1,26], 1, Concat, [1]],    # 31 cat head P4
    [-1, 3, C3, [512, False]],    # 32 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],    # 33
    [[-1,22], 1, Concat, [1]],     # 34 cat head P5
    [-1, 3, C3, [1024, False]],     # 35 (P5/32-large)

    [[29, 32, 35], 1, Detect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
